            # 실습시 고정폭 글꼴을 사용할 것!!

print('💖       💖        💖       💖💖💖💖    💖💖💖💖  ')
print('💖       💖     💖   💖     💖      💖  💖      💖 ')
print('💖💖💖💖💖   💖       💖   💖💖💖💖    💖💖💖💖  ')
print('💖       💖  💖💖💖💖💖💖  💖     💖   💖     💖  ')
print('💖       💖  💖         💖  💖      💖  💖      💖 ')

print('*   *    **     ****    ****    *   *')
print('*   *   *   *   *   *   *   *   *   *')
print('*****  *     *  ****    ****     * *')
print('*   *  *******  *   *   *   *     * ')
print('*   *  *     *  *    *  *    *    * ')

print('  /////  ')
print(' | o o | ')
print('(|  ^  |)')
print(' | [_] | ')
print('  _____  ')

print('            +---+')
print('            |   |')
print('        +---+---+')
print('        |   |   |')
print('    +---+---+---+')
print('    |   |   |   |')
print('+---+---+---+---+')
print('|   |   |   |   |')
print('+---+---+---+---+')

print('  /\_/\       ------  ')
print(' (     )    / Hello \  ')
print(' (     )   <  Junior | ')
print(' |  |  |    \ Coder!/  ')
print('  (_|_)        _____  ')


my_name = '안병구'
my_Weight = '75'
my_age = '52'

print('안녕하세요. 저의 이름은 ' + my_name + ' 입니다. 나의 몸무게는 ' + my_Weight + 'kg 이며,' + '나의 나이는 ' + my_age + ' 입니다.' )

# 3 * x
# 3 * x + y
# (x + Y) / 7
# (3 * x + y) / (z + 2)

# 4. 다음 문장의 실행 결과는 무엇인지 서술하세요.
number = (1 / 3) * 3; # 1
number_1 = (1/3)
number_10 = (10/3)
quotient = 7 / 3; # 2
remainder = 7 % 3; # 1

print(number_1)
print(number_10)

result = 11;
result /= 2;  #복합연산자


x, y, m, n = 2.5, -1.5, 18, 4

print(x + n * y - (x + n) * y)
print()
print()
print()
print()
