# 성적 처리프로그램 V4
# 학생의 이름, 국어, 영어, 수학, 점수를 키보드로 입력 받아
# 총점, 평균, 학점을처리한 뒤 결과 출력
# 성적처리의 CRUD를 메뉴식으로 구현

menus = f'''
---------------------
성적처리 프로그램 V4
---------------------
1. 성적데이터 입력
2. 성적데이터 조회
3. 성적데이터 상세조회
4. 성적데이터 수정
5. 성적데이터 삭제
0. 프로그램 종료
---------------------
작업을 선택하세요 : '''
# menus = '''...'''

for i in range(1,100+1):
    job = input(menus)

    # if job == '1': print('성적데이터 입력을 진행합니다.')
    # elif job == '2': print('성적데이터 조회를 진행합니다.')
    # elif job == '3': print('성적데이터 상세조회를 진행합니다.')
    # elif job == '4': print('성적데이터 수정을 진행합니다.')
    # elif job == '5': print('성적데이터 삭제를 진행합니다.')
    # elif job == '0':
    #     print('성적프로그램을 종료합니다.')
    #     break
    # else: print('번호를 잘못입력하셨습니다.')

    match job:
        case '1': print('성적데이터 입력을 진행합니다.')
        case '2': print('성적데이터 조회을 진행합니다.')
        case '3': print('성적데이터 상세조회를 진합니다.')
        case '4': print('성적데이터 수정을 진행합니다.')
        case '5': print('성적데이터 삭제을 진행합니다.')
        case '0':
            print('성적프로그램을 종료합니다.')
            break
        case _: print('번호를 잘못입력하셨습니다.'
                      '다시 제대로 입력해 주세요: ')


